src/Documents/ОСМИ_ПушРассылка/ОСМИ_ПушРассылка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОСМИ_ПушРассылка</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Карта</name>
      <type>
        <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОСМИ_ПушРассылка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Карты1С = Адресаты.ВыгрузитьКолонку("Карта");
	
	КартыОСМИ = Новый Массив;
	
	Для Каждого Карта Из Карты1С Цикл
		КартаОСМИ = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Карта); 
		Если не КартаОСМИ = Неопределено Тогда
			КартыОСМИ.Добавить(КартаОСМИ.Код);
		КонецЕсли;
	КонецЦикла;

	ОСМИ_РаботаСAPI.ОтправитьПушСообщение(Ложь,КартыОСМИ,,ДатаОтправки,ТекстСообщения);
КонецПроцедуры
